In [1]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
## describe()
- 통계량 요약, 숫자만 가능
- NaN값은 자동으로 제외

SyntaxError: invalid syntax (1481290267.py, line 2)

In [3]:
df.describe() # 유형이 숫자인 데이터만 요약

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [4]:
df.describe(include = 'object') # 유형이 문자인 데이터만 요약

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [ ]:
## count()
- 데이터의 개수, Null값 제외

In [4]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [5]:
df['age'].count()

np.int64(714)

In [6]:
## mean()

In [7]:
df['age'].mean()

np.float64(29.69911764705882)

In [11]:
df.mean(numeric_only=True) # 평균을 계산할 수 없는 데이터를 제외하고 숫자형 데이커만 평균 계산

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [13]:
df.mean(numeric_only=True, skipna=False) 
# numeric_only=True : 숫자만 계산
# skipna=False : NaN이 속해있으면 그 데이터는 계산하지 않고 넘어감

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [18]:
## 성인 남성 요금 평균
df.loc[df['who'] == 'man', 'fare'].mean()

np.float64(24.864181750465548)

In [17]:
## fare : 30~40 지불 승객 & 1등석 승객의 나이 평균
df.loc[(df['fare'] >= 30) & (df['fare'] <= 40) & (df['class'] == 'First'), 'age'].mean()

np.float64(44.095238095238095)

In [19]:
## median()
- 이상값이 너무 클 때 사용
- 비율적으로 가운데에 있는 데이터 접근
- 데이터 개수가 짝수면 중간 두개 데이터의 평균 출력

In [21]:
numbers = [1, 2, 10, 11, 100, 1000]
pd.Series(numbers).mean()

np.float64(187.33333333333334)

In [22]:
print(df['age'].mean())
print(df['age'].median())

29.69911764705882
28.0

In [ ]:
## sum()

In [23]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [24]:
df['fare'].sum()

np.float64(28693.9493)

In [25]:
df['fare'].cumsum() # 누적합

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [26]:
df['age'].cumprod() # 누적곱

C:\Users\1-13\Desktop\DAMF2\abcd\venv\Lib\site-packages\numpy\_core\fromnumeric.py:57: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

In [27]:
## var() : 표본분산
df['fare'].var()

np.float64(2469.436845743116)

In [29]:
fare_mean = df['fare'].mean()
total = ((df['fare'] - fare_mean) ** 2).sum()
total_count = df['fare'].count()-1 # 모분산은 n으로 나누고 표본분산은 n-1을 나눔

my_var = total / total_count
print(my_var)

2466.665311685043

In [ ]:
## std() : 표준편차

In [5]:
import numpy as np
np.sqrt(df['fare'].var())

np.float64(49.6934285971809)

In [6]:
df['fare'].std()

np.float64(49.6934285971809)

In [ ]:
## min(), max()

In [7]:
print(df['age'].min())
print(df['age'].max())

0.42
80.0

In [8]:
## agg() : aggregation

In [13]:
df['age'].agg(['min', 'max', 'mean', 'count'])
df[['age']].agg(['min', 'max', 'mean', 'count'])

min        0.420000
max       80.000000
mean      29.699118
count    714.000000
Name: age, dtype: float64
              age
min      0.420000
max     80.000000
mean    29.699118
count  714.000000

In [10]:
df[['age', 'fare']].agg(['min', 'max'])

       age      fare
min   0.42    0.0000
max  80.00  512.3292

In [ ]:
## quantile() : 분위수

In [14]:
df['age'].quantile(0.1) # 나이 하위 10%

np.float64(14.0)

In [15]:
df['age'].quantile(0.8) # 나이 상위 20%(=하위 80%)

np.float64(41.0)

In [16]:
df['age'].median()
df['age'].quantile(0.5)

np.float64(28.0)

In [17]:
## unique()

In [18]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [20]:
df['who'].nunique()

3

In [21]:
## mode() : 최빈값

In [22]:
df['who'].mode()

0    man
Name: who, dtype: object

In [23]:
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [ ]:
## corr() : 상관계수

In [24]:
df.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [25]:
df.corr(numeric_only=True)['age'] # 나이와 다른 변수들간의 상관관계

survived     -0.077221
pclass       -0.369226
age           1.000000
sibsp        -0.308247
parch        -0.189119
fare          0.096067
adult_male    0.280328
alone         0.198270
Name: age, dtype: float64